Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The example below shows the client being used to test the chat endpoint above.
ja_jp: 以下の例は、上記のチャットエンドポイントをテストするために使用されるクライアントを示しています。

source: The example below shows the differences between three endpoints, all of them querying a _fortune_ in the database then returning it to the client.
ja_jp: 以下の例は、3 つのエンドポイントの違いを示しています。これらのエンドポイントはすべて、データベース上の _財産_ を照会し、 それをクライアントに返します。

source: The example below shows the differences between three endpoints, all of them querying a fortune in the database then returning it to the client.
ja_jp: 以下の例は3つのエンドポイントの違いを示しています。これらのエンドポイントはすべてデータベースにクエリーを投げてクライアントに結果を返しています。

source: The example below will override the default behaviour and always run on a worker thread, even though it returns a `Uni`.
ja_jp: 以下の例は、デフォルトの動作をオーバーライドし、 `Uni` を返しても、常にワーカースレッドで実行されます。

source: The example from the last section was simplistic on purpose. Let's have a look at a few common patterns.
ja_jp: 前節の例は、あえて単純化したものでした。ここでは、いくつかの共通するパターンを見てみましょう。

source: The example function takes input passed in via the `--payload` switch which points to a json file in the root directory of the project.
ja_jp: サンプルの関数は、プロジェクトのルートディレクトリーにある json ファイルを指す `--payload` スイッチを介して渡された入力を受け取ります。

source: The example lambda takes input passed in via the `--payload` switch which points to a json file in the root directory of the project.
ja_jp: サンプルの Lambda は、プロジェクトのルートディレクトリーにある json ファイルを指す `--payload` スイッチを介して渡された入力を受け取ります。

source: The examples provided so far demonstrate role-to-permission mapping. It is also possible to programmatically add permissions to the `SecurityIdentity` instance. In the following example, xref:security-customization.adoc#security-identity-customization[`SecurityIdentity` is customized] to add the same permission that was previously granted with the HTTP role-based policy.
ja_jp: これまでに示した例は、ロールと権限のマッピングを示しています。 `SecurityIdentity` インスタンスにプログラムで権限を追加することも可能です。 次の例では、xref:security-customization.adoc#security-identity-customization[`SecurityIdentity`] がカスタマイズされ、以前に HTTP ロールベースポリシーで付与されたものと同じ権限が追加されます。

source: The exchange that messages are published to or consumed from. If not set, the channel name is used Type: _string_
ja_jp: メッセージが公開または消費されるエクスチェンジ。設定されていない場合、チャネル名が使用されます。 Type: _string_

source: The exchange that messages are published to or consumed from. If not set, the channel name is used. If set to `""`, the default exchange is used Type: _string_
ja_jp: メッセージが公開される、または消費されるエクスチェンジ。設定されていない場合、チャネル名が使用されます。 `""` に設定されている場合、デフォルトのExchangeが使用されます。 Type: _string_

source: The exchange type: direct, fanout, headers or topic (default) Type: _string_
ja_jp: エクスチェンジのType: 直接、ファンアウト、ヘッダー、またはトピック (デフォルト) Type: _string_

source: The executable built with `-Dquarkus-profile=test` is not suitable for production deployment. It contains your test resources files and settings. Once the testing is done, the executable would have to be built again, using the default, `prod` profile.
ja_jp: `-Dquarkus-profile=test` でビルドされた実行可能ファイルは、実稼働環境でのデプロイメントには適していません。 テスト用のリソースファイルや設定が含まれているからです。テストが終了したら、デフォルトの `prod` プロファイルを使用して実行可能ファイルを再度ビルドする必要があります。

source: The executable built with `-Dquarkus.profile=test` is not suitable for production deployment. It contains your test resources files and settings. Once the testing is done, the executable would have to be built again, using the default, `prod` profile.
ja_jp: `-Dquarkus.profile=test` でビルドされた実行可能ファイルは、実稼働環境でのデプロイメントには適していません。 なぜなら、テスト用のリソースファイルや設定が含まれているからです。 テストが終了したら、デフォルトの `prod` プロファイルを使用して、実行可能ファイルを再度ビルドする必要があります。

source: The executable should work now.
ja_jp: これで、実行可能ファイルが動作するようになるはずです。

source: The executable to compress is mounted in directory `/project`. Since the container runs `upx` in the current working directory, the `WORKDIR` of the image used for compression must be `/project`.
ja_jp: 圧縮する実行可能ファイルは、 `/project` ディレクトリーにマウントされます。コンテナーは現在の作業ディレクトリーで `upx` を実行するため、圧縮に使用されるイメージの `WORKDIR` は `/project` である必要があります。

source: The execution context to which the RequestScoped context is bound, in the previous example the REST call, controls the lifecycle of the context. This means that when the REST call is completed the RequestScoped context is destroyed. Therefore, you need to make sure that your processing or message dispatch is completed before the REST call completes.
ja_jp: RequestScoped コンテキストがバインドされる実行コンテキスト (前の例では REST コール) が、そのコンテキストのライフサイクルを制御します。これは、REST コールが完了すると RequestScoped コンテキストが破棄されることを意味します。したがって、REST コールが完了する前に処理またはメッセージディスパッチが完了していることを確認する必要があります。

source: The exhaustive list of parameters can be found in https://github.com/upx/upx/blob/devel/doc/upx.pod[the UPX documentation].
ja_jp: パラメーターの詳細なリストは、 https://github.com/upx/upx/blob/devel/doc/upx.pod[UPXのドキュメント]に記載されています。

source: The existing API had design flaws that wouldn’t have been easy to fix, so we were considering replacing it with a new implementation. Our small team had more experience in JVM languages than JavaScript, and since this was an API serving Java data, we thought eating our own dogfood would be a good thing!
ja_jp: 既存のAPIには設計上の欠陥があり、修正するのは容易ではありませんでしたので、新たな実装に置き換えることを検討していました。私たちの小さなチームは、JavaScriptよりもJVM言語の経験が豊富で、これはJavaデータを提供するAPIだったので、自分たちのドッグフードを食べるのは良いことだと考えました。

source: The expiration policy of a `CaffeineCache` can be changed while a Quarkus app is running if that policy was initially specified in the Quarkus configuration. Similarly, the maximum size of a `CaffeineCache` can be changed in real time if the cache was built with an initial maximum size defined in the configuration.
ja_jp: `CaffeineCache` の有効期限ポリシーは、そのポリシーが Quarkus の設定で最初に指定されている場合、Quarkus アプリの実行中に変更することができます。同様に、 `CaffeineCache` の最大サイズも、設定に定義された初期最大サイズでキャッシュが構築された場合、リアルタイムで変更できます。

source: The explicit bucket boundaries for the histogram.
ja_jp: ヒストグラムの明示的なバケット境界。

source: The exported "_start" function is called, to initialize the Go runtime. This executes the Go program `main()` function. As it's empty in our implementation, it will exit immediately, so we catch `WasiExitExcpetion` to check for a 0 (no errors) exit code.
ja_jp: Go ランタイムを初期化するために、エクスポートされた "_start" 関数が呼び出されます。これにより、Go プログラムの `main()` 関数が実行されます。今回の実装では中身が空であるため、すぐに終了します。そのため、 `WasiExitException` をキャッチして、終了コードが 0 (エラーなし) であることを確認します。

source: The exporter is automatically wired with CDI, that's why the `quarkus.otel.traces.exporter` and `quarkus.otel.metrics.exporter` properties default to `cdi`.
ja_jp: エクスポーターは自動的に CDI と接続されるため、 `quarkus.otel.traces.exporter` および `quarkus.otel.metrics.exporter` プロパティーはデフォルトで `cdi` になります。

source: The extension `quarkus-container-image-buildpack` is using buildpacks in order to perform container image builds. Under the hood buildpacks will use a Docker daemon for the actual build. While buildpacks support alternatives to Docker, this extension will only work with Docker.
ja_jp: `quarkus-container-image-buildpack` は、コンテナイメージのビルドを行うために buildpacks を使用しています。buildpacksは、実際のビルドにDockerデーモンを使用します。buildpacksはDockerの代替品をサポートしていますが、このエクステンションはDockerでのみ動作します。

source: The extension `quarkus-container-image-docker` is using the Docker binary and the generated Dockerfiles under `src/main/docker` in order to perform Docker builds.
ja_jp: エクステンション `quarkus-container-image-docker` は、Docker ビルドを実行するために `src/main/docker` 下で Docker バイナリーと生成された Dockerfiles を使用しています。

source: The extension `quarkus-container-image-jib` is powered by https://github.com/GoogleContainerTools/jib[Jib] for performing container image builds. The major benefit of using Jib with Quarkus is that all the dependencies (everything found under `target/lib`) are cached in a different layer than the actual application making rebuilds really fast and small (when it comes to pushing). Another important benefit of using this extension is that it provides the ability to create a container image without having to have any dedicated client side tooling (like Docker) or running daemon processes (like the Docker daemon) when all that is needed is the ability to push to a container image registry.
ja_jp: エクステンション `quarkus-container-image-jib` は、コンテナーイメージのビルドを実行するために link:https://github.com/GoogleContainerTools/jib[Jib] を使用しています。Jib を Quarkus で使用する主な利点は、すべての依存関係 (`target/lib` の下にあるすべてのもの) が実際のアプリケーションとは別のレイヤーにキャッシュされるため、リビルドが非常に高速かつ小規模に (プッシュする場合) 行えることです。このエクステンションを使用するもう 1 つの重要な利点は、コンテナーイメージレジストリーにプッシュする機能さえあれば、専用のクライアントサイドツール (Docker など) やデーモンプロセス (Docker デーモンなど) を実行しなくてもコンテナーイーメージを作成できることです。

source: The extension `quarkus-container-image-openshift` is using OpenShift binary builds in order to perform container builds inside the OpenShift cluster. The idea behind the binary build is that you just upload the artifact and its dependencies to the cluster and during the build they will be merged to a builder image (defaults to `fabric8/s2i-java`).
ja_jp: エクステンション `quarkus-container-image-openshift` は、OpenShift クラスタ内でコンテナのビルドを実行するために OpenShift バイナリビルドを使用しています。バイナリビルドの背景にある考え方は、アーティファクトとその依存関係をクラスタにアップロードするだけで、ビルド中にそれらがビルダーイメージ（デフォルトは `fabric8/s2i-java` ）にマージされるというものです。

source: The extension `quarkus-container-image-openshift` is using OpenShift binary builds in order to perform container builds inside the OpenShift cluster. The idea behind the binary build is that you just upload the artifact and its dependencies to the cluster and during the build they will be merged to a builder image (defaults to `ubi9/openjdk-17` or `ubi9/openjdk-21`).
ja_jp: エクステンション `quarkus-container-image-openshift` は、OpenShift クラスター内でコンテナービルドを実行するために、OpenShift バイナリービルドを使用しています。バイナリービルドの背景にある考え方は、アーティファクトとその依存関係をクラスターにアップロードするだけで、ビルド中にそれらがビルダーイメージ (デフォルトは `ubi9/openjdk-17` または `ubi9/openjdk-21`) にマージされるというものです。

source: The extension `quarkus-container-image-podman` uses https://podman.io/[Podman] and the generated `Dockerfiles` under `src/main/docker` in order to perform container builds.
ja_jp: エクステンション `quarkus-container-image-podman` は、コンテナビルドを実行するために link:https://podman.io/[Podman] と `src/main/docker` の下に生成された `Dockerfiles` を使用します。

source: The extension `quarkus-container-image-s2i` is using S2I binary builds in order to perform container builds inside the OpenShift cluster. The idea behind the binary build is that you just upload the artifact and its dependencies to the cluster and during the build they will be merged to a builder image (defaults to `fabric8/s2i-java`).
ja_jp: エクステンション `quarkus-container-image-s2i` は、OpenShift クラスター内でコンテナービルドを実行するために S2I バイナリービルドを使用しています。バイナリービルドの考え方は、アーティファクトとその依存関係をクラスタにアップロードするだけで、ビルド中にそれらがビルダーイメージにマージされます (デフォルトは `fabric8/s2i-java`)。

source: The extension allows the normal use of the Micrometer API, but have the metrics handled by the OpenTelemetry extension.
ja_jp: このエクステンションにより、Micrometer API の通常の使用が可能になりますが、メトリクスは OpenTelemetry エクステンションによって処理されます。

source: The extension allows to easily authenticate the users of your web application by redirecting them to the OpenID Connect Provider (e.g.: Keycloak) to login and, once the authentication is complete, return them back with the code confirming the successful authentication. The extension will request ID and access tokens from the OpenID Connect Provider using an authorization code grant and verify these tokens in order to authorize an access to the application.
ja_jp: このエクステンションは、OpenID Connect Provider (例: Keycloak) にリダイレクトしてログインさせ、認証が完了したら、認証に成功したことを確認するコードを使って、ウェブアプリケーションのユーザーを簡単に認証することができます。エクステンションは、認可コードグラントを使用して OpenID Connect Provider から ID とアクセストークンを要求し、アプリケーションへのアクセスを承認するためにこれらのトークンを検証します。

source: The extension also allows application code to override either of `io.fabric8.kubernetes.client.Config` or `io.fabric8.kubernetes.client.KubernetesClient` which are normally provided by the extension by simply declaring custom versions of those beans.
ja_jp: また、このエクステンションでは、アプリケーションコードは、単にそれらのBeanのカスタムバージョンを宣言することで、通常はエクステンションによって提供される `io.fabric8.kubernetes.client.Config` や `io.fabric8.kubernetes.client.KubernetesClient` のいずれかをオーバーライドすることができます。

source: The extension can be added to your build file like this:
ja_jp: エクステンションは次のようにビルドファイルに追加できます。

source: The extension catalog artifacts cached locally will be regularly checked for updates and updated if newer versions of those catalogs are available in the registry. The default interval to check for updates is *daily*, which matches the default Maven repository `updatePolicy` for SNAPSHOT artifacts.
ja_jp: ローカルにキャッシュされたエクステンションカタログアーティファクトは、定期的に更新がチェックされ、それらのカタログの新しいバージョンがレジストリで利用可能な場合は更新されます。更新をチェックするデフォルトの間隔は毎日で、これはSNAPSHOTアーティファクトのデフォルトのMavenリポジトリ `updatePolicy` に一致します。

source: The extension comes with default producers for `CriteriaBuilderFactory` and `EntityViewManager` that work out of the box given a working Hibernate ORM configuration. For customization, overriding of the default producers is possible via the standard mechanism as documented in the xref:cdi-reference.adoc#default_beans[Quarkus CDI reference]. This is needed if you need to set custom link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#anchor-configuration-properties[Blaze-Persistence properties].
ja_jp: このエクステンションには、 `CriteriaBuilderFactory` と `EntityViewManager` のデフォルトプロデューサーが付属しており、動作する Hibernate ORM 設定があればすぐに動作します。カスタマイズのために、 link:{quarkus-home-url}/guides/cdi-reference#default_beans[Quarkus CDIリファレンス]に記載されている標準的なメカニズムを使用して、デフォルトのプロデューサーをオーバーライドすることができます。これは、カスタムの link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#anchor-configuration-properties[Blaze-Persistenceプロパティー]を設定する場合に必要です。

source: The extension consists of a xref:rest.adoc[Quarkus REST (formerly RESTEasy Reactive)] server filter which creates and verifies CSRF tokens in `application/x-www-form-urlencoded` and `multipart/form-data` forms and a Qute HTML form parameter provider which supports the xref:qute-reference.adoc#injecting-beans-directly-in-templates[injection of CSRF tokens in Qute templates].
ja_jp: このエクステンションは、 xref:rest.adoc[Quarkus REST（旧RESTEasy Reactive）] サーバーフィルターで構成され、 `application/x-www-form-urlencoded` および `multipart/form-data` フォームで CSRF トークンの作成と検証を行います。また、Qute HTML フォームパラメータープロバイダーで、 xref:qute-reference.adoc#injecting-beans-directly-in-templates[Qute テンプレートへの CSRF トークンの注入] をサポートします。

source: The extension consists of a xref:resteasy-reactive.adoc[RESTEasy Reactive] server filter which creates and verifies CSRF tokens in `application/x-www-form-urlencoded` and `multipart/form-data` forms and a Qute HTML form parameter provider which supports the xref:qute-reference.adoc#injecting-beans-directly-in-templates[injection of CSRF tokens in Qute templates].
ja_jp: このエクステンションは、 `application/x-www-form-urlencoded` と `multipart/form-data` フォームの CSRF トークンを作成し検証する xref:resteasy-reactive.adoc[RESTEasy Reactive] サーバフィルターと、 xref:qute-reference.adoc#injecting-beans-directly-in-templates[QuteテンプレートへのCSRFトークン注入] をサポートする Qute HTML form parameter provider からなります。

source: The extension defines an instrumentable object as Agroal does with `io.agroal.api.AgroalDataSourceMetrics`, or
ja_jp: エクステンションは、Agroal が `io.agroal.api.AgroalDataSourceMetrics` で行うように、インストルメント可能なオブジェクトを定義します。

source: The extension description is important as it is displayed on https://code.quarkus.io/, when listing extensions with the Quarkus CLI, etc.
ja_jp: エクステンションの説明は、 https://code.quarkus.io/、Quarkus CLI でエクステンションをリスト表示する際などに表示されるため、重要です。

source: The extension enforces these permissions, granting or denying access based on the roles or policies defined in Keycloak.
ja_jp: エクステンションはこれらの権限を適用し、Keycloak で定義されたロールまたはポリシーに基づいてアクセスを許可または拒否します。

source: The extension framework facilitates reading metadata, scanning classes as well as generating classes as needed
ja_jp: エクステンションフレームワークは、必要に応じてメタデータの読み込み、クラスのスキャン、クラスの生成を容易にします。

source: The extension generates an example script within `target/bootstrap-example.sh`.
ja_jp: このエクステンションは、サンプルのスクリプト `target/bootstrap-example.sh` を生成します。

source: The extension groupId
ja_jp: エクステンション groupId

source: The extension id (not namespaced).
ja_jp: エクステンション ID (名前空間ではない)。

source: The extension includes `kafka-clients` version 3.1.0 as a transitive dependency and is compatible with Kafka brokers version 2.x.
ja_jp: このエクステンションには、 `kafka-clients` バージョン 3.1.0 が推移的依存関係として含まれており、Kafka ブローカーバージョン 2.x と互換性があります。

source: The extension includes `kafka-clients` version 3.2.1 as a transitive dependency and is compatible with Kafka brokers version 2.x.
ja_jp: このエクステンションには、 `kafka-clients` バージョン 3.2.1 が推移的依存関係として含まれており、Kafka ブローカーバージョン 2.x と互換性があります。

source: The extension includes `pulsar-clients-original` version 3.0.0 as a transitive dependency and is compatible with Pulsar brokers version 2.10.x.
ja_jp: このエクステンションには、 `pulsar-clients-original` バージョン 3.0.0 が推移的依存関係として含まれており、Pulsar ブローカーバージョン 2.10.x との互換性があります。

source: The extension is disabled by default in order to prevent the application for making API calls when it is not running in a Kubernetes environment. To enable it, set `quarkus.kubernetes-config.enabled=true` (for example using a specific xref:config-reference.adoc#profiles[profile]).
ja_jp: このエクステンションは、アプリケーションがKubernetes環境で実行されていないときにAPIコールを行うことを防ぐため、デフォルトでは無効になっています。有効にするには、 `quarkus.kubernetes-config.enabled=true` を設定してください（特定の link:config-reference.html#profiles[プロファイル]を使用するなど）。

source: The extension is updated regularly and the Dev Services will start the latest final version image of Infinispan. Use `quarkus.infinispan-client.devservices.image-name` property to specify another image that fits your needs.
ja_jp: エクステンションは定期的に更新され、Dev ServicesはInfinispanの最新の最終版イメージを起動します。ニーズに合った別のイメージを指定するには、 `quarkus.infinispan-client.devservices.image-name` プロパティを使用してください。

source: The extension name is the GAV name of the extension: e.g. `io.quarkus:quarkus-agroal`. But you can pass a partial name and Quarkus will do its best to find the right extension. For example, `agroal`, `Agroal` or `agro` will expand to `io.quarkus:quarkus-agroal`. If no extension is found or if more than one extension matches, you will see a red check mark ❌ in the command result.
ja_jp: エクステンション名は、エクステンションの GAV 名です: 例: `io.quarkus:quarkus-agroal`。ただし、部分的な名前を渡すことができ、Quarkus は適切な拡張子を見つけるために最善を尽くします。たとえば `agroal`、 `Agroal`、または `agro` は、io.quarkus:quarkus-agroal に展開されます。拡張子が見つからない場合、または複数の拡張子が一致する場合は、コマンドの結果に赤いチェックマーク ❌ が表示されます。

source: The extension name is the GAV name of the extension: e.g. `io.quarkus:quarkus-agroal`. But you can pass a partial name and Quarkus will do its best to find the right extension. For example, `agroal`, `Agroal` or `agro` will expand to `io.quarkus:quarkus-agroal`. If no extension is found or if more than one extensions match, you will see a red check mark ❌ in the command result.
ja_jp: `io.quarkus:quarkus-agroal` エクステンション名は、エクステンションのGAV名です。しかし、部分的な名前を渡すことができ、Quarkusは適切なエクステンションを見つけるために最善を尽くします。例えば、 `agroal` 、 `Agroal` 、 `agro` は `io.quarkus:quarkus-agroal` に展開されます。エクステンションが見つからなかったり、複数のエクステンションが一致した場合は、コマンドの結果に赤いチェックマーク❌が表示されます。

source: The extension name is the GAV name of the extension: e.g., `io.quarkus:quarkus-agroal`. However, you can pass a partial name, and Quarkus will do its best to find the right extension. For example, `agroal`, `Agroal`, or `agro` will expand to `io.quarkus:quarkus-agroal`. If no extension is found or more than one extension matches, you will see a red check mark ❌ in the command result.
ja_jp: エクステンション名は、エクステンションのGAV名です。例えば、 `io.quarkus:quarkus-agroal` です。ただし、部分名を渡すこともでき、Quarkusは正しいエクステンションを見つけるために最善を尽くします。例えば、 `agroal` 、 `Agroal` 、 `agro` は、 `io.quarkus:quarkus-agroal` に展開されます。エクステンションが見つからない場合、または複数のエクステンションが一致する場合は、コマンド結果に赤いチェックマーク❌が表示されます。

source: The extension points (trigger listeners, job listeners, plugins) configuration have changed, so if you are using this feature, please refer to link:/guides/quartz#quartz-configuration-reference[the updated documentation] to migrate your configuration.
ja_jp: 拡張ポイント(トリガーリスナー、ジョブリスナー、プラグイン)の設定が変更されていますので、この機能をご利用の方は、 link:/guides/quartz#quartz-configuration-reference[更新されたドキュメント] を参照して設定を移行してください。

source: The extension provides an implementation of the https://download.eclipse.org/microprofile/microprofile-lra-1.0-M1/microprofile-lra-spec.html[MicroProfile LRA specification] and its associated https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/index.html?org/eclipse/microprofile/lra/annotation/ws/rs/LRA.html[annotations].
ja_jp: このエクステンションは、 link:https://download.eclipse.org/microprofile/microprofile-lra-1.0-M1/microprofile-lra-spec.html[MicroProfile LRA仕様]とその関連 link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/index.html?org/eclipse/microprofile/lra/annotation/ws/rs/LRA.html[アノテーション]の実装を提供します。

source: The extension provides helpers to check the content:
ja_jp: エクステンションは、コンテンツをチェックするためのヘルパーを提供します:

source: The extension provides helpers to test that the projects build `buildAllProjects` or just a specific language project `buildProject(Language language)`. It also provides helpers to test the content with <<snapshot-testing>>.
ja_jp: このエクステンションは、プロジェクトのビルド `buildAllProjects` や、特定の言語のプロジェクト `buildProject (Language language)` をテストするヘルパーを提供します。また、 <<snapshot-testing>> でコンテンツをテストするヘルパーも提供しています。

source: The extension provides helpers to test that the projects build `buildAllProjects` or just a specific language project `buildProject(Language language)`. It also provides helpers to test the content with xref:snapshot-testing[Snapshot testing].
ja_jp: エクステンションは、プロジェクトが `buildAllProjects` をビルド、あるいは特定の言語プロジェクト `buildProject(Language language)` だけをビルドすることをテストするヘルパーを提供します。また、 xref:snapshot-testing[Snapshotテスト] によってコンテンツをテストするためのヘルパーも提供します。

source: The extension provides its own abstraction of metrics, as Jaeger does with `io.jaegertracing.spi.MetricsFactory`.
ja_jp: エクステンションは、Jaeger が `io.jaegertracing.spi.MetricsFactory` で行うように、独自のメトリクスの抽象化を提供します。

source: The extension repository should be named `quarkus-<project>`
ja_jp: エクステンションのリポジトリの名前は `quarkus-<project>` であるべきです。

source: The extension should allow runtime config, such as the `CredentialsProviderConfig` from the `vault` extension to configure any custom property in the provider. For an AWS Secrets Manager extension, this could be:
ja_jp: エクステンションでは、 `vault` エクステンションの `CredentialsProviderConfig` のように、ランタイム設定でプロバイダー内の任意のカスタムプロパティーを設定できるようにしておく必要があります。AWS Secrets Managerエクステンションの場合は、次のようになります。

source: The extension understands the following types of ConfigMaps and Secrets as input sources:
ja_jp: エクステンションは、以下のタイプの ConfigMaps と Secrets を入力ソースとして理解します。

source: The extension works by reading ConfigMaps and Secrets directly from the Kubernetes API server using the xref:kubernetes-client.adoc[Kubernetes Client].
ja_jp: このエクステンションは、Kubernet link:kubernetes-client[Kubernates クライアント] を使用してKubernetes APIサーバーから直接ConfigMapsとSecretsを読み込むことで動作します。

source: The extensions that have been moved are:
ja_jp: 移動されたエクステンションは次の通りです:

source: The extensions that integrate with the existing quarkus-resteasy extension also integrate with quarkus-resteasy-reactive extensions. So you can continue to use _CDI_, _Security_, _Metrics_, _JSON_, _Qute_, _Bean Validation_, _OpenAPI_ and enjoy a great out of the box and complete development experience.
ja_jp: 既存のquarkus-resteasyエクステンションと統合するエクステンションは、quarkus-resteasy-reactiveエクステンションとも統合されます。そのため、_CDI_、_Security_、_Metrics_、_JSON_、_Qute_、_Bean Validation_、_OpenAPI_を使い続けることができ、素晴らしいアウトオブボックスと完全な開発体験を楽しむことができます。
